{
    "data": {
      "citiesVisiteds": [
        {
          "country": "Singapore",
          "continent": "Asia",
          "description": "It is the city I live, and it deserves to be the **first** post. I was born here and growing up, I have come to realise that the pace of life (as a young adult) is extremely hectic. I think that it is very much expected as Singapore is a small nation, zero resources and heavily reliant on manpower to sustain the economy.\n\nOutside the hustle and bustle of life, the city is indeed exploding with culture. Being a multiracial society, we embrace our differences and even celebrate them. I particularly enjoyed going to Arab Street and Kampong Glam.\n\nUnfortunately, I cannot give much of a tourist perspective, since I am a local. Transport is very convenient and it takes less than an hour to go from East Coast to West Coast via MRT. Our bus system is also very good (better than the surrounding nations). Most Singaporeans depend on our efficient transportation system (with some minor hiccups occasionally) very much to get around.\n\nIf you are a tourist or traveller yourself, do come down to Singapore and feel the culture. If all else fails, I guess there is Sentosa as the last resort for you to have fun.",
          "slug": "singapore",
          "cityName": "Singapore"
        },
        {
          "country": "Malaysia",
          "continent": "Asia",
          "description": "Penang is hands-down my favourite state in Malaysia. It is home to Gurney Drive, which is a street that sells amazing hawker food. In the city centre, there are pieces of colonial history everywhere for one to enjoy.\n\nMy family always buys Tau Sah Piah (peanut pastry) in Penang, and would bring around 2 boxes back to Singapore.\n\nIf you are up for some exercise, I would recommend hiking up Penang Hill where you can view Penang Island from its peek. There is also a tram for those who hate being healthy.\n\nOverall, this place screams holiday and relaxation. I will always pick Penang as my favourite place in Malaysia and the #1 holiday spot for me.",
          "slug": "penang",
          "cityName": "Penang"
        },
        {
          "country": "Japan",
          "continent": "Asia",
          "description": "The capital of Hokkaido Island. Home to the finest Sapporo Beer. *Of course, I was underage at that time to try that wine (15 years of age at 2015).*\n\nMy family drove from Otaru to Sapporo where we lodged at Sapporo Hotel (How befitting). As it was my first time to Japan, I had no idea that the price of land use is so high, which is why even a modestly nice hotel room for 4 people is still pretty small. Out luggage took up most of the corridor and it was quite inconvenient. However, that's is not the main part of the story here.\n\nWe spent around 4 days in Sapporo. On the first day, we went to the Chocolate Factory which sells the very nice ***Ishia Shiroi Koibito White Chocolate cookie***\nwhich I am very much still in love today. We bought boxes of them back to Singapore. We also went to a cheese factory in the outskirts but for some reason, the main factory is not open, so we went to the museum instead. Despite this, the journey to the Cheese Factory was stunning as the view outside the car along the expressway was marvelous under the setting sun.\n\nThe next day we went to a beer factory which produces the iconic Sapporo Beer. My parents and uncles drank the beer whereas me and my cousins just ate the bread they provided. I remembered buying a lot of instant noodles from a nearby store so that we can have dinner at the hotel.\n\nThe next few days were boring because my parents wanted to shop. I am **NOT** a big fan of shopping at all.\n\nMy family did not really take any public transport. We just rented a car and drove along with my cousins' family. Driving through the quaint little towns reminded me of the cartoons from Studio Ghibli which nicely depicts the classical age of Japanese animation.\n\nWould very much like to return to Hokkaido and specifically Sapporo. If I were to go alone or with friends though, I think I will probably rent a car and drive too, but I will visit the various museums all around Hokkaido and avoid the shopping districts at all costs.",
          "slug": "sapporo",
          "cityName": "Sapporo"
        },
        {
          "country": "Germany",
          "continent": "Europe",
          "description": "    \"Ich Bin Ein Berliner!\" - President John F. Kennedy\n\nBerlin is the capital of Germany and boasts a pretty long history. It was the capital of the Margraviate of Brandenburg, and after a personal union with the Kingdom of Prussia, Berlin rose to become the capital of the German Empire.\n\nI was pretty excited to arrive at Berlin, the people are very friendly and the place is extremely beautiful. Among the places we visited were the Reichstag (the German Parliament), and right next to it was the German Chancellory (back then it was Angela Merkel's office). For obvious reasons we were not allowed to enter the office buildings so I just hung about in the yard outside and took pictures and admired the glass dome of the Reichstag. It is indeed a very old building as compared to the modern-looking glass-plated Chancellory Building.\n\nWe then set off to the Brandenburg Gate where sections of the Berlin Wall stood. The Berlin Wall was the symbol of the Iron Curtain dividing the Communist East from the Capitalist West. I was unsure if you could actually get a piece of the original wall and bring it home as a souvenir (Please don't). If you really want one, then just willingly get scammed by the nearby gift shops where they packet the \"wall pieces\" in nice plastic on display or those \"wall keychains\" as well.\n\nAnother highlight was Checkpoint Charlie, which was the best-known Berlin Wall crossing point between East Berlin and West Berlin during the Cold War (1947–1991), as named by the Western Allies. A section of the American guard post was still there and it was very crowded with tourists. A word of caution though, there are many children pickpockets. They go up to unsuspecting victims to ask for some signature and next thing you know, you are walking home missing something. Parents with kids, please be vigilant!\n\nI would visit Berlin again for a walking trip and explore the older parts of the city more thoroughly. There is so much more to learn about the place!",
          "slug": "berlin",
          "cityName": "Berlin"
        },
        {
          "country": "Poland",
          "continent": "Europe",
          "description": "Krakow is one of the most beautiful places I have been. It boasts a very rich history of glory and tragedy. It was once the seat of power for the Polish Kings before it was moved to Warsaw. The guide told me that the people of Krakow still bore a grudge on that issue. Haha.\n\nWhen I arrived at Krakow, it was already evening, but what I saw first thing which caught my eye was the Wawel Dragon statue breathing fire through its metallic snout. According to Wikipedia: *\"The Wawel Dragon (Polish: Smok Wawelski) is a famous dragon in Polish mythology who lived in a cave at the foot of Wawel Hill on the banks of the Vistula River. One of the many popular stories about the dragon takes place in Kraków during the reign of King Krakus, the city's mythical founder.\"*\n\n\nThe dragon statue apparently can breathe fire everytime a SMS message was sent to a specific number, or else it breathes out the fire once every 5 minutes.\n\nI came to know of this city after watching ***Schindler's List*** starring Liam Neeson. There used to be a Jewish Ghetto in Krakow where millions of Jews were transported to Death Camps, mainly to Auschwitz. It is a very tragic story, and indeed the scars of wars still remain despite the tall buildings that seem to cloud over it.\n\nAnother highlight for me was the visit to ***Wieliczka Salt Mine***. I was astonished by the sheer expertise of engineering displayed by the Poles. The salt mine goes down 327 metres and it is so big, you can hold a soccer match below (which happened 1 week after I visited by the way). There were many salt lakes underneath I highly recommend this stop. It is about 50km south of Krakow but I would suggest going with a tour just in case you get lost in the labyrinth of trails underground.\n\nThe last stop was to Auschwitz-Birkenau Concentration camp. I witnessed the iconic train track that leads to the entrance of the camp. I saw the dreadful living conditions of the inmates and also the nasty gas chambers which were used to eliminate the prisoners. This stop serves as a reminder that hate leads to darkness and it leads to even good men (minus Hitler and his crazy gang) doing unspeakable evil. \n\nI find this city trip to be more educational than touristy as the amount of knowledge and history which I have learnt is considerably more than the other cities I have visited. The pictures I see in History books look all too familiar now that I have seen it with my own eyes. Poland, and Krakow specifically has suffered so much over the centuries. It survived technically 4 partitions and was one of the earliest casualties of war and genocide. Krakow is very high on my return list when I come to Europe and Poland again.",
          "slug": "krakow",
          "cityName": "Krakow"
        }
      ]
    }
  }